УРВ_файловая/src/Catalogs/Сервисы/Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сервисы</name>
  <attributes>
    <name>ВнешнийАдресМенеджераСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВитрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяЛиния</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьПользователейОЗакрытииОбращений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутренний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетныеЗаписиСлужбыПоддержки</name>
    <attributes>
      <name>УчетнаяЗапись</name>
      <type>
        <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Сервисы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
    КонецЕсли;
    
    ИсходныйПрефикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Префикс");
	ДополнительныеСвойства.Вставить("ИсходныйПрефикс", ИсходныйПрефикс);
    
    ПроверитьЗаполнение();
    
    Если ЭтоНовый() Тогда
        Если Не ЗначениеЗаполнено(Ссылка) Тогда
            УстановитьСсылкуНового(Справочники.Сервисы.ПолучитьСсылку(Новый УникальныйИдентификатор));
        КонецЕсли;
        ОсновнаяВитринаОбъект = Справочники.Витрины.СоздатьЭлемент();
        ОсновнаяВитринаОбъект.Владелец = ПолучитьСсылкуНового();
        ОсновнаяВитринаОбъект.Наименование = Наименование;
        ОсновнаяВитринаОбъект.УчетнаяЗапись = УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию;
        ОсновнаяВитринаОбъект.Записать();
        ОсновнаяВитрина = ОсновнаяВитринаОбъект.Ссылка;
    ИначеЕсли ЗначениеЗаполнено(ОсновнаяВитрина) И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВитринСервисов") Тогда
        // Если исползуется только одна витрина, поддержим актуальность ее полей в соответствие с полями сервиса.
        ОсновнаяВитринаОбъект = ОсновнаяВитрина.ПолучитьОбъект();
        ОсновнаяВитринаОбъект.Наименование = Наименование;
        ОсновнаяВитринаОбъект.УчетнаяЗапись = УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию;
        ОсновнаяВитринаОбъект.Записать();
    КонецЕсли;
	
	//{Рарус kruser 26.04.2019 84132
	ПроверитьОсновнойСервис(Отказ);
	//}Рарус kruser 26.04.2019 84132

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("Префикс") И ДополнительныеСвойства.ИсходныйПрефикс <> Префикс Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 
	
КонецПроцедуры

//{Рарус kruser 26.04.2019 84132
&НаСервере
Процедура ПроверитьОсновнойСервис(Отказ)
	
	Если ОсновнойСервис Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сервисы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сервисы КАК Сервисы
		|ГДЕ
		|	НЕ Сервисы.ПометкаУдаления
		|	И Сервисы.Внутренний = &Внутренний
		|	И Сервисы.ОсновнойСервис
		|	И НЕ Сервисы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Внутренний", Внутренний);
		Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Пустой();
		
		Если Не РезультатЗапроса Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сервис по умолчанию уже указан");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//}Рарус kruser 26.04.2019 84132

#КонецОбласти

#КонецЕсли
